app/Http/Controllers/AreaController.php

select * from `area`
---
    public function index()
    {
        $DetailUser = DetailUser::where('user_id',Auth::id())->first();
        $area = Area::all();