app/Http/Controllers/PopController.php

select * from `area` where `active` = '1'
select * from `pop` where `pop`.`area_id` in ('1', '2', '4', '5', '6', '7', '10', '13', '14', '15', '18', '19', '20', '24', '25', '26', '28', '29', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '49', '52', '53', '54', '55', '56', '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67', '68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78', '79', '80', '81', '82', '83', '84', '85', '86', '87', '88', '89', '90', '91', '92', '93', '94', '95', '96', '97', '98', '99', '100', '101', '102', '104', '105', '106', '107', '108', '109', '110', '111', '112', '113', '114', '115', '116', '117', '118', '119', '120', '121', '122', '123', '124', '125', '126', '127', '128', '129', '130', '131', '132', '133', '134', '135', '136', '137', '138', '139', '140', '141', '142', '143', '144', '145', '146', '147', '148', '149', '150', '151', '206')
select * from `store` where `store`.`area_id` in ('1', '2', '4', '5', '6', '7', '10', '13', '14', '15', '18', '19', '20', '24', '25', '26', '28', '29', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '49', '52', '53', '54', '55', '56', '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67', '68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78', '79', '80', '81', '82', '83', '84', '85', '86', '87', '88', '89', '90', '91', '92', '93', '94', '95', '96', '97', '98', '99', '100', '101', '102', '104', '105', '106', '107', '108', '109', '110', '111', '112', '113', '114', '115', '116', '117', '118', '119', '120', '121', '122', '123', '124', '125', '126', '127', '128', '129', '130', '131', '132', '133', '134', '135', '136', '137', '138', '139', '140', '141', '142', '143', '144', '145', '146', '147', '148', '149', '150', '151', '206')
---
    public function index2() //for hq group
    {
        $area = Area::with('store','pop')->where('active','=',1)->get();

select * from `Detail_User` where `Detail_User`.`user_id` = '31' and `Detail_User`.`user_id` is not null limit 1
select * from `area` where `area`.`id` = '2' limit 1
select * from `pop` where `area_id` = '2'
select * from `area` where `area`.`id` in ('2')
select * from `store` where `area_id` = '2'
select * from `move` where `area_id` = '2'
select `product`.`id` as `id`, `product`.`name` as `name`, sum(detail_pop.qty) as sum from `pop` left join `detail_pop` on `pop`.`id` = `detail_pop`.`pop_id` left join `product` on `detail_pop`.`product_id` = `product`.`id` where `area_id` = '2' group by `product`.`id`, `product`.`name`
select * from `users` where `users`.`id` = '31' limit 1
select * from `Detail_User` where `Detail_User`.`user_id` = '30' and `Detail_User`.`user_id` is not null
select `product`.`id` as `id`, `product`.`name` as `name`, sum(product_store.qty) as sum from `area` left join `store` on `area`.`id` = `store`.`area_id` inner join `product_store` on `store`.`id` = `product_store`.`store_id` left join `product` on `product_store`.`product_id` = `product`.`id` where `area_id` = '2' group by `product`.`id`, `product`.`name`
---
    public function index3() // for hr group
    {
        $area = Area::find(Auth::user()->detailuser->area_id);
        $store = Store::where('area_id',Auth::user()->detailuser->area_id)->with('area','pop')->get();
        $pop = Pop::where('area_id',Auth::user()->detailuser->area_id)->get();
        $move = Move::where('area_id',Auth::user()->detailuser->area_id)->get();
        $alls = DB::table('pop')
        ->leftjoin('detail_pop', 'pop.id', '=', 'detail_pop.pop_id')
        ->leftjoin('product', 'detail_pop.product_id', '=', 'product.id')
        ->where('area_id', Auth::user()->detailuser->area_id)
        ->select('product.id as id','product.name as name', DB::raw("sum(detail_pop.qty) as sum"))
        ->groupBy('product.id','product.name')
        ->get();
        return view('pop.index3',compact('alls','store','area','pop','move'))
            ->with('i');

select * from `area` where `area`.`id` in ('2')
select * from `group` where `group`.`id` in ('')
select * from `pop` order by `created_at` desc
select * from `status` where `status`.`id` in ('4', '6')
select * from `pop` where `area_id` = '2' order by `created_at` desc
select * from `users` where `users`.`id` in ('31')
---
    public function list2() // list pop for hq group
    {
        //$users = Auth::user()->detailuser()->get();
        $pop = Pop::orderBy('created_at', 'desc')->with('area','group','status','store','user')->get();
        return view('pop.list2',compact('pop'))
            ->with('i');

select * from `area` where `area`.`id` in ('2')
select * from `status` where `status`.`id` in ('15')
select * from `store` where `store`.`id` in ('4')
select * from `move` order by `created_at` desc
select * from `status` where `status`.`id` in ('14', '15')
select * from `store` where `store`.`id` in ('4', '477')
---
    public function list22() // list pop for hq group
    {
        $move = Move::orderBy('created_at', 'desc')
            // ->where('status_id','!=',8)
            // ->where('status_id','!=',9)
            // ->where('status_id','!=',11)
            // ->where('status_id','!=',12)
            ->with('area','fromstore','tostore','status')->get();
        return view('pop.list22',compact('move'))
            ->with('i');

select * from `area` where `area`.`id` in ('2')
select * from `store` where `area_id` = '2'
select * from `group` where `group`.`id` in ('')
select * from `pop` where `area_id` = '2' order by `created_at` desc
select * from `status` where `status`.`id` in ('1', '4')
select * from `status` where `status`.`id` in ('6')
select * from `store` where `store`.`id` in ('4', '477')
select * from `product`
select * from `users` where `users`.`id` in ('31')
select * from `Detail_User` where `Detail_User`.`user_id` = '31' and `Detail_User`.`user_id` is not null limit 1
---
    public function list3() // list pop for hr group
    {
        $store = Store::where('area_id','=',Auth::user()->detailuser->area_id)->get();
        $pop = Pop::where('area_id','=',Auth::user()->detailuser->area_id)->with('user','group','area','store','status')->orderBy('created_at', 'desc')->get();
        // $move = Move::where('area_id','=',Auth::user()->detailuser->area_id)->with('user','group','area','store','status')->orderBy('created_at', 'desc')->get();
        $alls = DB::table('pop')
        ->leftjoin('detail_pop', 'pop.id', '=', 'detail_pop.pop_id')
        ->leftjoin('product', 'detail_pop.product_id', '=', 'product.id')
        ->where('area_id', Auth::user()->detailuser->area_id)
        ->select('product.id as id','product.name as name', DB::raw("sum(detail_pop.qty) as sum"))
        ->groupBy('product.id','product.name')
        ->get();

        return view('pop.list3',compact('alls','store','area','pop'))
            ->with('i');

select * from `store` where `area_id` = '2'
select * from `move` where `area_id` = '2' order by `created_at` desc
select * from `users` where `users`.`id` in ('31')
---
    public function list33() // list pop for hr group
    {
        $store = Store::where('area_id','=',Auth::user()->detailuser->area_id)->get();
        $move = Move::where('area_id','=',Auth::user()->detailuser->area_id)->with('user')->orderBy('created_at', 'desc')->get();

select * from `store` where `area_id` = '2'
select * from `product`
---
    public function create3($id)
    {
        $id;
        $store = Store::where('area_id',Auth::user()->detailuser->area_id)->get();
        $product = Product::all();

select * from `store` where `store`.`id` = '4' limit 1
select * from `pop` where `store_id` = '4' and `status_id` = '6'
select * from `store` where `area_id` = '2'
---
    public function create33($id)
    {
        $from = Store::find($id);
        $pops = Pop::where('store_id',$id)->where('status_id',6)->get();

        // $product = DB::table('product_store')
        // ->leftjoin('product', 'product_store.product_id', '=', 'product.id')
        // ->where('store_id', $id)
        // ->get();
        // $store2 = ProductStore::where('store_id',$id)->get();
        $store = Store::where('area_id',Auth::user()->detailuser->area_id)->get();

insert into `pop` (`periode_id`, `user_id`, `area_id`, `status_id`, `active`, `store_id`, `posisi`, `ukuran`, `updated_at`, `created_at`) values ('1', '31', '2', '1', '1', '2882', '0', '0', '2018-03-23 13:02:13', '2018-03-23 13:02:13')
insert into `detail_pop` (`pop_id`, `product_id`, `qty`, `updated_at`, `created_at`) values ('16', '1', '1', '2018-03-23 13:02:13', '2018-03-23 13:02:13')
---
    public function store3(Request $request) // for hr group
    {
        $this->validate($request, [
            'periode_id' => 'required|integer',
            'user_id' => 'required|integer',
            'area_id' => 'required|integer',
            'store_id' => 'required|integer',
            'posisi' => 'required|integer',
            'ukuran' => 'required|integer',
            'active' => 'required|boolean',
            'photo.*' => 'required|image|mimes:jpeg,png,jpg,gif,svg',
            'product_id.*' => 'required|different:product_id',
            'qty' => 'required|array:integer'
        ]);
        $pop = Pop::create($request->all());
        if ($pop->save())
        {
            $input = $request->all();
            for ($i=0; $i < count($input['product_id']); ++$i)
            {
                $detailpop = new DetailPop;
                $detailpop->pop_id = $pop->id;
                $detailpop->product_id = $input['product_id'][$i];
                $detailpop->qty = $input['qty'][$i];
                $detailpop->save();

insert into `photo_pop` (`pop_id`, `type`, `photo`, `updated_at`, `created_at`) values ('16', '1', 'images/2882/DFmKe80NZxschcFLm0MlEaoyRYG599XDkMbmfLuV.jpeg', '2018-03-23 13:02:13', '2018-03-23 13:02:13')
---
                Storage::makeDirectory($imgPath, $mode = 0775, true);
                $filename = $photo->store($imgPath);
                $filename = $photo->store($imgPath);
                PhotoPop::create([
                    'pop_id' => $pop->id,
                    'type' => 1,
                    'photo' => $filename
                ]);

select * from `area` where `area`.`id` = '2' limit 1
select `product`.`id` as `id`, `product`.`name` as `name`, sum(detail_pop.qty) as sum from `pop` left join `detail_pop` on `pop`.`id` = `detail_pop`.`pop_id` left join `product` on `detail_pop`.`product_id` = `product`.`id` where `area_id` = '2' group by `product`.`id`, `product`.`name`
select * from `product` where `product`.`id` in ('1', '4')
select * from `area` where `area`.`id` in ('2')
select * from `store` where `area_id` = '2'
select * from `pop` where `area_id` = '2'
select * from `pop` where `pop`.`id` = '95' limit 1
select * from `detail_pop` where `pop_id` = '95'
select * from `area`
select * from `store`
---
    public function show2($id) // show area for hq group
    {
        $area = Area::find($id);
        $alls = DB::table('pop')
        ->leftjoin('detail_pop', 'pop.id', '=', 'detail_pop.pop_id')
        ->leftjoin('product', 'detail_pop.product_id', '=', 'product.id')
        ->where('area_id', $id)
        ->select('product.id as id','product.name as name', DB::raw("sum(detail_pop.qty) as sum"))
        ->groupBy('product.id','product.name')
        ->get();
        $store = Store::with('area')->where('area_id','=',$id)->get();
        $pop = Pop::where('area_id','=',$id)->get();
        return view('pop.show2',compact('store','area','alls','pop'))
            ->with('i');

select * from `pop` where `pop`.`id` = '92' limit 1
select * from `photo_pop` where `pop_id` = '92'
select * from `detail_pop` where `pop_id` = '92'
select * from `area`
select * from `store`
select * from `status`
select * from `group`
select * from `detail_pop` where `pop_id` = '16'
select * from `pop` where `pop`.`id` = '16' limit 1
---
    public function show3($id) // show pop for hr group
    {
        $pop = Pop::find($id);
        $photopop = PhotoPop::where('pop_id',$id)->get();
        $detailpop = DetailPop::where('pop_id',$id)->get();
        $area = Area::all();
        $store = Store::all();
        $status = Status::all();
        $group = Group::all();
        return view('pop.show3',compact('detailpop','pop','area','group','store','status','photopop'))
            ->with('i');

select * from `move` where `move`.`id` = '3' limit 1
select * from `Detail_Move` where `move_id` = '3'
select * from `photo_move` where `move_id` = '3'
---
    public function show33($id) // show pop for hr group
    {
        $move = Move::find($id);
        $detailmove = DetailMove::where('move_id',$id)->with('product')->get();
        $photomove = PhotoMove::where('move_id',$id)->get();
        return view('pop.show33',compact('move','detailmove','photomove'))
            ->with('i');

select * from `pop` where `pop`.`id` = '86' limit 1
select * from `detail_pop` where `pop_id` = '86'
---
    public function show22($id)
    {
        $pop = Pop::find($id);
        $detailpop = DetailPop::where('pop_id',$id)->get();

select * from `move` where `move`.`id` = '5' limit 1
select * from `Detail_Move` where `move_id` = '5'
select * from `move` where `move`.`id` = '2' limit 1
select * from `photo_move` where `move_id` = '5'
select * from `Detail_Move` where `move_id` = '2'
---
    public function show222($id)
    {
        $move = Move::find($id);
        $detailmove = DetailMove::where('move_id',$id)->get();
        $photomove = PhotoMove::where('move_id',$id)->get();
        return view('pop.show222',compact('detailmove','move','photomove'))
            ->with('i');

select * from `store`
---
    public function edit3($id)
    {
        $pop = Pop::find($id);
        $photopop = PhotoPop::where('pop_id',$id)->get();
        $detailpop = DetailPop::where('pop_id',$id)->get();
        $area = Area::all();
        $store = Store::all();
        $status = Status::all();
        $group = Group::all();
        return view('pop.edit3',compact('detailpop','pop','area','group','store','status','photopop'))
            ->with('i');

select * from `move` where `move`.`id` = '4' limit 1
select * from `photo_move` where `move_id` = '5'
select * from `Detail_Move` where `move_id` = '5'
select * from `move` where `move`.`id` = '5' limit 1
select * from `store` where `area_id` = '2'
---
    public function edit33($id)
    {
        $move = Move::find($id);
        $photomove = PhotoMove::where('move_id',$id)->get();
        $detailmove = DetailMove::where('move_id',$id)->get();
        // $area = Area::all();
        $store = Store::where('area_id',Auth::user()->detailuser->area_id)->get();
        // $status = Status::all();
        // $group = Group::all();
        return view('pop.edit33',compact('detailmove','move','area','group','store','status','photomove'))
            ->with('i');

select * from `store` where `store`.`id` = '4' limit 1
insert into `photo_move` (`move_id`, `type`, `photo`, `updated_at`, `created_at`) values ('3', '1', 'images/43273/B3ojtFWHDiVVva3KnXALtyzK2WnfcFo4DwSemufd.jpeg', '2018-03-23 12:31:06', '2018-03-23 12:31:06')
---
    public function update33(Request $request, $id)
    {
        if ($request->status == 8) {
            $this->validate($request, [
                'to_store_id' => 'required|integer',
            ]);
            $move = Move::where('id',$id)->update([
                'status_id' => 7,
                'to_store_id' => $request->to_store_id,
            ]);
        }
        if ($request->status == 9) {
            $this->validate($request, [
                'photo.*' => 'required|image|mimes:jpeg,png,jpg,gif,svg',
            ]);
            $file = PhotoMove::where('move_id',$id)->where('type',1)->get();
            foreach ($file as $file) {
                Storage::delete($file->photo);
            }
            PhotoMove::where('move_id',$id)->where('type',1)->delete();
            foreach ($request->photo as $photo)
            {
                $imgPath = 'images/move/'.$id;
                Storage::makeDirectory($imgPath, $mode = 0775, true);
                $filename = $photo->store($imgPath);
                PhotoMove::create([
                    'move_id' => $id,
                    'type' => 1,
                    'photo' => $filename
                ]);

update `pop` set `note` = 'ok', `status_id` = '3', `updated_at` = '2018-03-23 13:08:27' where `id` = '16'
---
    public function update4(Request $request, $id)
    {
        $this->validate($request, [
            'photo' => 'required'
        ]);
        if ($request->hasFile('photo'))
        {
            $files = $request->photo2;
            File::delete($files);
            PhotoPop::where('pop_id',$id)->where('type',2)->delete();
            foreach ($request->photo as $photo)
            {
                $imgPath = 'images/'.$request->store_id;
                $imgDestinationPath = $imgPath.'';
                $filename = $photo->store($imgDestinationPath);
                PhotoPop::create([
                    'pop_id' => $id,
                    'type' => $request->type,
                    'photo' => $filename
                ]);
            }
        }
        $pop = Pop::where('id',$id)->update(['status_id' => 11]);

select * from `pop` where `pop`.`id` = '22' limit 1
update `pop` set `note` = '-', `status_id` = '6', `updated_at` = '2018-03-28 04:32:29' where `id` = '86'
select * from `pop` where `pop`.`id` = '86' limit 1
select * from `detail_pop` where `pop_id` = '86'
select * from `product_store` where `store_id` = '4'
---
    public function approve(Request $request, $id) // approve & reject only for hq group
    {
        if ($request->approve_pop) {
            $pop = Pop::findOrFail($id)->update([
                'status_id' => '3',
                'note' => $request->note,
            ]);
            return redirect()->action('PopController@list2')
                ->with('success','Approve POP successfully');
        }
        if ($request->reject_pop) {
            $pop = Pop::findOrFail($id)->update([
                'status_id' => '2',
                'note' => $request->note,
            ]);
            return redirect()->action('PopController@list2')
                ->with('warning','Reject POP successfully');
        }
        if ($request->pop_done) {
            // $pop = Pop::findOrFail($id)->update([
            //     'status_id' => '6',
            //     'note' => $request->note,
            // ]);

            $detailpop = DetailPop::where('pop_id',$id)->get();
            $hitung=$detailpop->count();
            $store = ProductStore::where('store_id',$request->store_id)->get();

insert into `product_store` (`store_id`, `product_id`, `qty`, `updated_at`, `created_at`) values ('4', '1', '1', '2018-03-28 04:32:29', '2018-03-28 04:32:29')
select * from `product_store` where `store_id` = '4' and `product_id` = '1'
---
                    $productstore->store_id = $request->store_id;
                    $productstore->product_id = $detailpop[$i]['product_id'];
                    $productstore->qty = $detailpop[$i]['qty'];
                    $productstore->save();
                }
            }else{
                for($i=0;$i<$hitung;++$i){
                    $store1 = ProductStore::where('store_id',$request->store_id)->where('product_id',$detailpop[$i]['product_id'])->get();
                    if ($store1->isEmpty()) {
                        $find = ProductStore::where('store_id',$request->store_id)->create([
                            'store_id' => $request->store_id,
                            'product_id' => $detailpop[$i]['product_id'],
                            'qty' => $detailpop[$i]['qty']
                        ]);

update `product_store` set `qty` = '1', `updated_at` = '2018-03-28 04:57:05' where `store_id` = '4' and `product_id` = '1'
---
                                $cekproduct=$store2->product_id;
                                $cekqty=$store2->qty;
                                $total=$cekqty+$detailpop[$i]['qty'];
                                $find = ProductStore::where('store_id',$request->store_id)->where('product_id',$cekproduct)->update([
                                     'qty' => $total
                            ]);

select * from `store` where `store`.`id` = '4' limit 1
select * from `pop` where `store_id` = '4' and `status_id` = '10'
select * from `area` where `area`.`id` in ('2')
select * from `group` where `group`.`id` in ('')
select * from `status` where `status`.`id` in ('6')
select * from `store` where `store`.`id` in ('4')
select `product`.`id` as `id`, `product`.`name` as `name`, sum(detail_pop.qty) as sum from `pop` left join `detail_pop` on `pop`.`id` = `detail_pop`.`pop_id` left join `product` on `detail_pop`.`product_id` = `product`.`id` where `store_id` = '4' group by `product`.`id`, `product`.`name`
---
    public function history3($id) // history  per store hr group
    {
        $store = Store::findOrFail($id);
        $pop = Pop::where('store_id',$id)->where('status_id',10)->with('area','user','store','group','status')->get();
        $alls = DB::table('pop')
        ->leftjoin('detail_pop', 'pop.id', '=', 'detail_pop.pop_id')
        ->leftjoin('product', 'detail_pop.product_id', '=', 'product.id')
        ->where('store_id', $id)->where('status_id', 10)
        ->select('product.id as id','product.name as name', DB::raw("sum(detail_pop.qty) as sum"))
        ->groupBy('product.id','product.name')
        ->get();
        return view('pop.history3',compact('pop','store','alls'))
            ->with('i');

select * from `pop` where `pop`.`id` = '92' limit 1
select * from `product` where `product`.`id` in ('1')
select * from `detail_pop` where `pop_id` = '92'
select * from `area`
---
    public function history2($id) //  for hq group
    {
        $store = Store::findOrFail($id);
        $pop = Pop::where('store_id',$id)->where('status_id',10)->with('area','user','store','group','status')->get();
        $alls = DB::table('pop')
        ->leftjoin('detail_pop', 'pop.id', '=', 'detail_pop.pop_id')
        ->leftjoin('product', 'detail_pop.product_id', '=', 'product.id')
        ->where('store_id', $id)
        ->select('product.id as id','product.name as name', DB::raw("sum(detail_pop.qty) as sum"))
        ->groupBy('product.id','product.name')
        ->get();
        return view('pop.history2',compact('pop','store','alls'))
            ->with('i');

select * from `photo_pop` where `pop_id` = '92'
---
    public function history5($id)
    {

        $pop = Pop::find($id);
        $photopop = PhotoPop::where('pop_id',$id)->get();