app/Http/Controllers/PopController.php

select * from `pop` where `pop`.`id` = '13' limit 1
select * from `group`
select * from `pop` where `pop`.`id` = '15' limit 1
select * from `status`
select * from `photo_pop` where `pop_id` = '15'
---
    public function show4($id)
    {

        $pop = Pop::find($id);
        $photopop = PhotoPop::where('pop_id',$id)->get();
        $detailpop = DetailPop::where('pop_id',$id)->get();
        $area = Area::all();
        $store = Store::all();
        $status = Status::all();
        $group = Group::all();
        return view('pop.show4',compact('detailpop','pop','area','group','store','status','photopop'))
            ->with('i');

select * from `photo_pop` where `pop_id` = '14'
select * from `status`
---
    public function edit3($id)
    {
        $pop = Pop::find($id);
        $photopop = PhotoPop::where('pop_id',$id)->get();
        $detailpop = DetailPop::where('pop_id',$id)->get();
        $area = Area::all();
        $store = Store::all();
        $status = Status::all();