app/Http/Controllers/StatusController.php

    public function index()
    {
        $DetailUser = DetailUser::where('user_id',Auth::id())->first();
        $status = Status::all();
---
select * from `status`