app/Http/Controllers/StoreController.php

select * from `store`
---
    public function index()
    {
        $store = Store::with('area')->get();