app/Http/Controllers/UserController.php

select * from `users`
---
    public function index()
    {
        $DetailUser = DetailUser::where('user_id',Auth::id())->first();
        $user = User::with('DetailUser','area')->get();
                // $area = Area::all();
        return view('user.index',compact('user','area','DetailUser'))
            ->with('i');

select * from `group`
select * from `area`
---
    public function create()
    {
        $DetailUser = DetailUser::where('user_id',Auth::id())->first();
        $group = Group::all();
        $area = Area::all();

select * from `users` where `users`.`id` = 'set' limit 1
select * from `users` where `users`.`id` = 'create3' limit 1
---
    public function show($id)
    {
        $DetailUser = DetailUser::where('user_id',Auth::id())->first();
        $User = User::findOrFail($id);
        $user1 = User::with('DetailUser')->where('id',Auth::id())->get();